ЛИС2/src/Documents/лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах/лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах/лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах</name>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.лис_КомпонентыЗамеровЛаборатории</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </resources>
  <resources>
    <name>Методика</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеПоРасчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АктОтбора</name>
    <type>
      <types>DocumentRef.лис_АктОтбораПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаОтбораПробы</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОпределяемыйПоказатель</name>
    <type>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Documents/лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах/ManagerModule.bsl
Функция ПечатьЖурналОпределенияКомпонентовВПромышленныхВыбросах(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах_ЖурналОпределенияКомпонентовВПромышленныхВыбросах";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.ПФ_MXL_ЖурналОпределенияКомпонентовВПромышленныхВыбросах");
		
	Для каждого ТекущийОбъект из МассивОбъектов Цикл
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Шапка
		Область = Макет.ПолучитьОбласть("ОбластьШапка");
		ТабличныйДокумент.Вывести(Область);
		
		НЗ = РегистрыСведений.лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(ТекущийОбъект);
		НЗ.Прочитать();
		
		Номер = 0;
		// Строки
		Для каждого Проба из НЗ Цикл
			
			Номер = Номер + 1;
			Область = Макет.ПолучитьОбласть("ОбластьСтрока");
			Область.Параметры.Номер = Номер;
			Область.Параметры.Дата = Формат(Проба.ДатаОтбора, "ДФ=dd.MM.yy");
			Область.Параметры.Заполнить(Проба);
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
	    // Подвал
		Область = Макет.ПолучитьОбласть("ОбластьПодвал");
		Область.Параметры.Ответственный = ТекущийОбъект.Ответственный;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции	

// Формирует печатные формы
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналОпределенияКомпонентовВПромышленныхВыбросах") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналОпределенияКомпонентовВПромышленныхВыбросах", "Журнал определения компонентов в промышленных выбросах",
			ПечатьЖурналОпределенияКомпонентовВПромышленныхВыбросах(МассивОбъектов, ОбъектыПечати),, "Документ.лис_ЖурналОпределенияКомпонентовВПромышленныхВыбросах.ПФ_MXL_ЖурналОпределенияКомпонентовВПромышленныхВыбросах");
			
	КонецЕсли; 
	
КонецПроцедуры
